Revert pipeline doc
